Repository: crazyfeyn/fitness_app
Catalog: lib/l10n/app_*.arb
Languages: uz

source: Hello
uz: Salom

source: Good Morning
uz: Hayrli tong

source: Good Afternoon
uz: Hayrli kun

source: Good Evening
uz: Hayrli kech

source: Good Night
uz: Hayrli tun

# today_workout_plan
source: Today's Workout Plan
uz: Bugungi mashg'ulot rejangiz

# day
source: Day 01 - Warm Up
uz: 1-kun - Isinish

source: Workout Categories
uz: Mashg'ulot toifalari

source: See All
uz: Barchasini ko'rish

source: New Workouts
uz: Yangi mashg'ulotlar

# learn_basic_training
source: Learn the Basics of Training
uz: Mashg'ulotning asoslarini o'rganing

# workouts_for_beginner
source: 06 Workouts for Beginners
uz: Boshqaruvchilar uchun 6 ta mashg'ulot

# congratulations_message
source: Congratulations, you have completed your daily workouts!
uz: Tabriklaymiz, siz kunlik mashg'ulotlaringizni tugatdingiz!

source: Start Exercising!
uz: Mashg'ulotni boshlang!

source: Skip
uz: O‘tkazib yuborish

# add_10_sec
source: +10 seconds
uz: +10 soniya

source: Rest
uz: Dam olish

source: Exercise
uz: Mashg'ulot

source: seconds
uz: soniya

source: Loading...
uz: Yuklanmoqda...

source: Workout
uz: Mashg'ulot

source: Welcome Back!
uz: Qaytganingizdan xursandmiz!

# login_with_credentials
source: Log in with your credentials or use another account
uz: Kirish uchun ma'lumotlaringiz bilan kiring yoki boshqa hisobdan foydalaning

source: Hello, Rookies,
uz: Salom, yangilar,

# enter_information
source: Enter your information below or log in with another account
uz: Quyida ma'lumotlaringizni kiritishingiz yoki boshqa hisob bilan kirishingiz mumkin

source: Back to Login
uz: Kirishga qaytish

source: Sign Up
uz: Ro'yxatdan o'tish

source: EDIT PROFILE
uz: PROFILNI TREDIT QILISH

# profile_updated_success
source: Profile updated successfully!
uz: Profil muvaffaqiyatli yangilandi!

# profile_error
source: Error: {error}
uz: Xato: {error}

source: PRIVACY POLICY
uz: SHAXSIYLIK SIYOSATI

source: Sign Out
uz: Chiqish

source: SETTINGS
uz: SOZLAMALAR

source: Language
uz: Til

source: Contact Us
uz: Biz bilan bog'laning

source: Save
uz: Saqlash

source: Workout Intensity
uz: Mashg'ulot intensivligi

source: Duration
uz: Davomiylik

source: Feedback
uz: Fikr-mulohaza

source: Completed
uz: Tugallandi

source: Summary
uz: Xulosa

# error_network
source: Network error, please try again.
uz: Tarmoq xatosi, iltimos, qayta urinib ko'ring.

# error_invalid_input
source: Invalid input, please check your data.
uz: Noto'g'ri kirish, iltimos, ma'lumotlaringizni tekshiring.

# success_data_saved
source: Your data has been saved successfully!
uz: Ma'lumotlaringiz muvaffaqiyatli saqlandi!

# welcome_message
source: Welcome to our Fitness App!
uz: Futbol ilovamizga xush kelibsiz!

# start_your_journey
source: Start your fitness journey today!
uz: Bugun fitness sayohatingizni boshlang!

source: Select Activity Level
uz: Faoliyat darajasini tanlang

source: Select Age
uz: Yoshni tanlang

source: years
uz: yil

source: Select Gender
uz: Jinsni tanlang

source: Select Goal
uz: Maqsadni tanlang

source: Select Height
uz: Bo'yni tanlang

source: Select Weight
uz: Vaznni tanlang

source: Tell us about yourself!
uz: O'zingiz haqingizda ayting!

# betterExperienceMessage
source: To give you a better experience we need to know your gender
uz: Sizga yaxshiroq tajriba taqdim etish uchun bizga jinsingizni bilishimiz kerak

# previous
source: Pre
uz: Oldingi

source: Next
uz: Keyingi

source: Done
uz: Bajardim

# skipRestTitle
source: Skip Rest?
uz: Dam olishni o‘tkazib yuborish?

# skipRestConfirmation
source: Are you sure you want to skip the rest period?
uz: Dam olish vaqtini o‘tkazib yuborishga aminmisiz?

source: Cancel
uz: Bekor qilish

source: RESTING TIME
uz: DAM O‘LISH VAKTI

# onboarding_title_1
source: Meet your coach, Start your journey
uz: Maqsadlaringizga erishishingizga yordam beradigan murabbiy bilan tanishing

# onboarding_title_2
source: Create a workout plan to stay fit
uz: Fizik holatingizni saqlash uchun trening rejasini tuzing

# onboarding_title_3
source: Action is the key to all success
uz: Harakat barcha muvaffaqiyatlar kalitidir

source: Get started
uz: Boshlash

# name_label
source: Name
uz: Ism

# save_label
source: Save
uz: Saqlash

# userInfoTitle
source: Tell us about yourself!
uz: O'zingiz haqida ma'lumot bering!

# userInfoSubtitle
source: To give you a better experience we need to know your gender
uz: Yaxshi tajriba berish uchun biz sizning jinsingizni bilishimiz kerak

source: Male
uz: Erkak

source: Female
uz: Ayol

source: Select Language
uz: Tilni tanlash

source: English
uz: Ingliz

source: Uzbek
uz: O'zbek

source: Russian
uz: Rus
